import { v4 as uuidv4 } from 'uuid';

export type Direction = {
    id: string
    name: string
    description: string
    requirements: string[]
}

export const directions: Direction[] = [
    {
        id: uuidv4(),
        name: 'Бизнес. Партнерство. Развитие',
        description: 'структурирование сделок, сопровождение ключевых клиентов...',
        requirements: [
            'базовое понимание составления и анализа финансовой отчетности',
            'Знание основ корпоративных финансов',
            'Уверенный пользователь MS Excel'
        ]
    },
    {
        id: uuidv4(),
        name: 'Финансовый бизнес ВЭБа',
        description: 'Описание Блока финансов...',
        requirements: ['Требование 3', 'Требование 4']
    },
    {
        id: uuidv4(),
        name: 'Блок управления рисками',
        description: 'Описание Блока управления рисками...',
        requirements: ['Требование 5', 'Требование 6']
    },
    {
        id: uuidv4(),
        name: 'Активы ВЭБа: новые решения',
        description: 'Описание Активы ВЭБа: новые решения...',
        requirements: ['Требование 7', 'Требование 8']
    },
    {
        id: uuidv4(),
        name: 'Центр "Технологии. Процессы. Данные"',
        description: 'Описание Центр "Технологии. Процессы. Данные"...',
        requirements: ['Требование 9', 'Требование 10']
    },
    {
        id: uuidv4(),
        name: 'Пульс ВЭБа',
        description: 'Описание Пульс ВЭБа...',
        requirements: ['Требование 11', 'Требование 12', 'Требование 13', 'Требование 14']
    },
    {
        id: uuidv4(),
        name: 'Закон и право - опора бизнеса',
        description: 'Описание Блока Закон и право - опора бизнеса...',
        requirements: ['Требование 15', 'Требование 16']
    },
    {
        id: uuidv4(),
        name: 'Люди - главное',
        description: 'Описание Блока Люди - главное...',
        requirements: ['Требование 17', 'Требование 18']
    },
    {
        id: uuidv4(),
        name: 'Блок стратегии',
        description: 'Описание Блок стратегии...',
        requirements: ['Требование 19', 'Требование 20']
    },
    {
        id: uuidv4(),
        name: 'Дом ВЭБа',
        description: 'Описание Дом ВЭБа...',
        requirements: ['Требование 21', 'Требование 22']
    },
    {
        id: uuidv4(),
        name: 'Центр "Решения и документы"',
        description: 'Описание Блока Центр "Решения и документы"...',
        requirements: ['Требование 23', 'Требование 24']
    },
    {
        id: uuidv4(),
        name: 'Безграничные возможности',
        description: 'Описание международного...',
        requirements: ['Требование 25', 'Требование 26']
    },
    {
        id: uuidv4(),
        name: 'Служба комплаенса',
        description: 'Описание Службы комплаенса...',
        requirements: ['Требование 27', 'Требование 28']
    },
    {
        id: uuidv4(),
        name: 'Офис ВЭБ.РФ',
        description: 'Описание Аппарата Председателя...',
        requirements: ['Требование 29', 'Требование 30']
    },

]

